In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
pd.pandas.set_option("display.max_columns", None)

In [ ]:
dataset = pd.read_csv('Zomato.csv')

In [ ]:
dataset.info()

In [ ]:
dataset.head()

In [ ]:
features_with_nan   = [features for features in dataset.columns if dataset[features].isnull().sum()>=1]

In [ ]:
for features in features_with_nan:
    print(features, np.round(dataset[features].isnull().mean(),4), '% missing values')

In [ ]:
numerical_features = [features for features in dataset.columns if dataset[features].dtypes!= "O"]

In [ ]:
dataset[numerical_features]

In [ ]:
sns.boxplot(dataset['Votes'])

In [ ]:
data = dataset.copy()
for features in numerical_features:
    data[features] = np.where(dataset[features].isnull(),1,0)
    data.groupby(features)['Votes'].median().plot.bar()

In [ ]:
descrite_features = [features for features in numerical_features if len(dataset[features]<=25)]

In [ ]:
dataset = dataset.head()
data = dataset.copy()
for features in descrite_features:
    data.groupby(features)['Votes'].median().plot.bar()

In [ ]:
dataset[descrite_features].shape

In [ ]:
continious_features =  [features for features in numerical_features if features not in descrite_features]

In [ ]:
dataset[continious_features]

In [ ]:
data = dataset.copy()
for features in continious_features:
    data.groupby(features)['Voles'].median().plot.hist()

In [ ]:
sns.boxplot(continious_features)

In [ ]:
dataset[continious_features].unique()

In [ ]:
categorical_features = [features for features in dataset.columns if dataset[features].dtypes == 'O']

In [ ]:
dataset[categorical_features].shape

In [ ]:
for features in categorical_features:
    print('the feature name is {} and theire categories is {} '.format(features,np.round(dataset[features].isnull().mean(),4),4))

In [ ]:
dataset[categorical_features].isnull().sum()

In [ ]:
data = dataset.copy()
for features in categorical_features:
    data.groupby(features)['Votes'].median().plot.bar()

In [ ]:
dataset[categorical_features]

In [ ]:
numerical_features_nan=[feature for feature in dataset.columns if dataset[feature].dtypes!='O' and
                       dataset[feature].isnull().sum()>=1]

In [ ]:
numerical_features_nan

In [ ]:
dataset.head()

In [ ]:
plt.scatter(dataset['Aggregate rating'],dataset['Votes'])

In [ ]:
dataset.shape

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df_train =  pd.read_csv('D:\\Software\\black friday train test dataset\\train.csv')

In [4]:
df_test =  pd.read_csv('D:\\Software\\black friday train test dataset\\test.csv')

In [6]:
df  = df_train.append(df_test)

In [8]:
df.shape

(783667, 12)

In [11]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969.0

In [12]:
df.drop('User_ID',axis = 1, inplace= True)

In [13]:
df.describe()

,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,783667.000000,783667.000000,783667.000000,537685.000000,237858.000000,550068.000000
mean,8.079300,0.409777,5.366196,9.844506,12.668605,9263.968713
std,6.522206,0.491793,3.878160,5.089093,4.125510,5023.065394
min,0.000000,0.000000,1.000000,2.000000,3.000000,12.000000
25%,2.000000,0.000000,1.000000,5.000000,9.000000,5823.000000
50%,7.000000,0.000000,5.000000,9.000000,14.000000,8047.000000
75%,14.000000,1.000000,8.000000,15.000000,16.000000,12054.000000
max,20.000000,1.000000,20.000000,18.000000,18.000000,23961.000000

In [16]:
[features for features in df.columns if df[features].dtypes != "O"]

AttributeError: 'list' object has no attribute 'describe'

In [21]:
df.dtypes[df.dtypes =='object']

Product_ID                    object
Gender                        object
Age                           object
City_Category                 object
Stay_In_Current_City_Years    object
dtype: object

#missing values

In [23]:
df.isnull().sum()

Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            245982
Product_Category_3            545809
Purchase                      233599
dtype: int64

In [24]:
df['Product_Category_2'].unique()

array([nan,  6., 14.,  2.,  8., 15., 16., 11.,  5.,  3.,  4., 12.,  9.,
       10., 17., 13.,  7., 18.])

In [25]:
df['Product_Category_3'].unique()

array([nan, 14., 17.,  5.,  4., 16., 15.,  8.,  9., 13.,  6., 12.,  3.,
       18., 11., 10.])

In [30]:
df['Product_Category_2'] = df['Product_Category_2'].fillna(df['Product_Category_2'].mode()[0])

In [32]:
df['Product_Category_3'] = df['Product_Category_3'].fillna(df['Product_Category_3'].mode()[0])

In [31]:
df['Product_Category_2'].isnull().sum()

0

In [33]:
df['Product_Category_3'].isnull().sum()

0

In [34]:
df.isnull().sum()

Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2                 0
Product_Category_3                 0
Purchase                      233599
dtype: int64

In [35]:
df.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,F,0-17,10,A,2,0,3,8.0,16.0,8370.0
1,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,P00087842,F,0-17,10,A,2,0,12,8.0,16.0,1422.0
3,P00085442,F,0-17,10,A,2,0,12,14.0,16.0,1057.0
4,P00285442,M,55+,16,C,4+,0,8,8.0,16.0,7969.0

In [36]:
df['Gender'].unique()

array(['F', 'M'], dtype=object)

In [37]:
df['Gender'].map({"F":1,"M":2})

0         1
1         1
2         1
3         1
4         2
         ..
233594    1
233595    1
233596    1
233597    1
233598    1
Name: Gender, Length: 783667, dtype: int64

In [44]:
df = pd.get_dummies(df,columns=['Gender'])

In [45]:
df['City_Category'].unique()

array(['A', 'C', 'B'], dtype=object)

In [46]:
df['City_Category'].map({"A":1,"B":2,"C":3})

0         1
1         1
2         1
3         1
4         3
         ..
233594    2
233595    2
233596    2
233597    3
233598    2
Name: City_Category, Length: 783667, dtype: int64

In [48]:
df = pd.get_dummies(df,columns=['City_Category'])

In [49]:
df

,Product_ID,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender_F,Gender_M,City_Category_A,City_Category_B,City_Category_C
0,P00069042,0-17,10,2,0,3,8.0,16.0,8370.0,1,0,1,0,0
1,P00248942,0-17,10,2,0,1,6.0,14.0,15200.0,1,0,1,0,0
2,P00087842,0-17,10,2,0,12,8.0,16.0,1422.0,1,0,1,0,0
3,P00085442,0-17,10,2,0,12,14.0,16.0,1057.0,1,0,1,0,0
4,P00285442,55+,16,4+,0,8,8.0,16.0,7969.0,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
233594,P00118942,26-35,15,4+,1,8,8.0,16.0,NaN,1,0,0,1,0
233595,P00254642,26-35,15,4+,1,5,8.0,16.0,NaN,1,0,0,1,0
233596,P00031842,26-35,15,4+,1,1,5.0,12.0,NaN,1,0,0,1,0
233597,P00124742,46-50,1,4+,0,10,16.0,16.0,NaN,1,0,0,0,1
233598,P00316642,46-50,0,4+,1,4,5.0,16.0,NaN,1,0,0,1,0

In [60]:
df['Stay_In_Current_City_Years'].str.replace('+',' ')

<ipython-input-60-3978ab239cdc>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df['Stay_In_Current_City_Years'].str.replace('+',' ')

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
          ..
233594   NaN
233595   NaN
233596   NaN
233597   NaN
233598   NaN
Name: Stay_In_Current_City_Years, Length: 783667, dtype: float64

In [61]:
df['Stay_In_Current_City_Years'] = df['Stay_In_Current_City_Years'].str.replace('+','')

<ipython-input-61-9f60e03f2c04>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df['Stay_In_Current_City_Years'] = df['Stay_In_Current_City_Years'].str.replace('+','')

In [62]:
df.head()

,Product_ID,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender_F,Gender_M,City_Category_A,City_Category_B,City_Category_C
0,P00069042,0-17,10,NaN,0,3,8.0,16.0,8370.0,1,0,1,0,0
1,P00248942,0-17,10,NaN,0,1,6.0,14.0,15200.0,1,0,1,0,0
2,P00087842,0-17,10,NaN,0,12,8.0,16.0,1422.0,1,0,1,0,0
3,P00085442,0-17,10,NaN,0,12,14.0,16.0,1057.0,1,0,1,0,0
4,P00285442,55+,16,NaN,0,8,8.0,16.0,7969.0,0,1,0,0,1

In [70]:
df.info()

AttributeError: 'Series' object has no attribute 'info'

In [64]:
df['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [68]:
df = df['Age'].map({'0-17':1,'55+':2,'26-35':3,'46-50':4,'51-55':5,'36-45':6,'18-25':7})

In [69]:
pd.get_dummies(df,columns=['Age'])

        1  2  3  4  5  6  7
0       1  0  0  0  0  0  0
1       1  0  0  0  0  0  0
2       1  0  0  0  0  0  0
3       1  0  0  0  0  0  0
4       0  1  0  0  0  0  0
...    .. .. .. .. .. .. ..
233594  0  0  1  0  0  0  0
233595  0  0  1  0  0  0  0
233596  0  0  1  0  0  0  0
233597  0  0  0  1  0  0  0
233598  0  0  0  1  0  0  0

[783667 rows x 7 columns]